In [1]:
import pandas as pd

dictionary = {'a':1,'b':2,'c':3}
series = pd.Series(dictionary)
print(series)

a    1
b    2
c    3
dtype: int64

In [2]:
# Dataframe
data = {'Name':['Bijon','Ankita','Akriti'],'Age':[38,34,5],'City':['Hyderabad','Hyderabad','Bangalore']}
df = pd.DataFrame(data)
print(df)

     Name  Age       City
0   Bijon   38  Hyderabad
1  Ankita   34  Hyderabad
2  Akriti    5  Bangalore

In [3]:
import numpy as np
print(np.array(df))

[['Bijon' 38 'Hyderabad']
 ['Ankita' 34 'Hyderabad']
 ['Akriti' 5 'Bangalore']]

In [4]:
# Create Dataframe from a list of dictionaries
data_list = [{'Name':'Bijon','Age':38,'City':'Hyderabad'},
             {'Name':'Ankita','Age':34,'City':'Hyderabad'},
             {'Name':'Akriti','Age':5,'City':'Bangalore'}]
df2 = pd.DataFrame(data_list)
print(df2)

     Name  Age       City
0   Bijon   38  Hyderabad
1  Ankita   34  Hyderabad
2  Akriti    5  Bangalore

In [5]:
df2.Name

0     Bijon
1    Ankita
2    Akriti
Name: Name, dtype: object

In [9]:
df2.iloc[0][1]

/var/folders/jy/z7hpn3yd3x9cr2kbxhjw27700000gn/T/ipykernel_1795/954693248.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df2.iloc[0][1]

np.int64(38)

In [12]:
df2['Salary'] = [0,20000000,-50000]
# df2.drop('Salary',axis=1,inplace=True)
print(df2)

     Name  Age       City    Salary
0   Bijon   38  Hyderabad         0
1  Ankita   34  Hyderabad  20000000
2  Akriti    5  Bangalore    -50000

In [13]:
df2.describe()

             Age        Salary
count   3.000000  3.000000e+00
mean   25.666667  6.650000e+06
std    18.009257  1.156147e+07
min     5.000000 -5.000000e+04
25%    19.500000 -2.500000e+04
50%    34.000000  0.000000e+00
75%    36.000000  1.000000e+07
max    38.000000  2.000000e+07

In [15]:
wine_df = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/wine-quality/winequality-red.csv',header=None,sep=';')
wine_df.head()

,0,1,2,3,4,5,6,7,8,9,10,11
0,fixed acidity,volatile acidity,citric acid,residual sugar,chlorides,free sulfur dioxide,total sulfur dioxide,density,pH,sulphates,alcohol,quality
1,7.4,0.7,0,1.9,0.076,11,34,0.9978,3.51,0.56,9.4,5
2,7.8,0.88,0,2.6,0.098,25,67,0.9968,3.2,0.68,9.8,5
3,7.8,0.76,0.04,2.3,0.092,15,54,0.997,3.26,0.65,9.8,5
4,11.2,0.28,0.56,1.9,0.075,17,60,0.998,3.16,0.58,9.8,6